src/Services/Air/templates/AIR_PRICING_FARE_RULES.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <air:AirPriceReq TraceId="test" AuthorizedBy="{{requestId}}" TargetBranch="{{TargetBranch}}" CheckOBFees="false" FareRuleType="long" xmlns:air="http://www.travelport.com/schema/air_v36_0" xmlns:com="http://www.travelport.com/schema/common_v36_0"> <!-- TicketDate="?" CheckFlightDetails="false" -->
            <com:BillingPointOfSaleInfo OriginApplication="uAPI"/>
            <air:AirItinerary>
                {{#trips}}
                <air:AirSegment Key="{{@index}}" Group="0" ProviderCode="1G"
                                Carrier="{{airline}}"
                                CabinClass="{{serviceClass}}"
                                FlightNumber="{{flightNumber}}"
                                Origin="{{from}}"
                                Destination="{{to}}"
                                DepartureTime="{{departure}}"
                                ArrivalTime="{{arrival}}"
                                TravelTime="{{duration}}"
                                ClassOfService="{{bookingClass}}"
                                TravelOrder="{{@index}}" />
                {{/trips}}
            </air:AirItinerary>
            {{#each uapi_traveler_refs}}
            <com:SearchPassenger BookingTravelerRef="{{this}}" Code="ADT" />
            {{/each}}
            {{#each passengers}}
            <com:SearchPassenger Key="P_{{@index}}" Code="{{ageType}}" />
            {{/each}}
            {{#if overridePcc}}
            <air:PCC>
                <com:OverridePCC ProviderCode="1G" PseudoCityCode="{{overridePcc}}"/>
            </air:PCC>
            {{/if}}
        </air:AirPriceReq>
    </soapenv:Body>
</soapenv:Envelope>